Revit 2024 API
PreviewControl.AddHandler Method
Overload List
Name | Description
AddHandler(RoutedEvent, Delegate)
Adds a routed event handler for a specified routed event, adding the handler to the handler collection on the current element.
 (Inherited from UIElement.)
AddHandler(RoutedEvent, Delegate, Boolean)
Adds a routed event handler for a specified routed event, adding the handler to the handler collection on the current element. Specify handledEventsToo as true to have the provided handler be invoked for routed event that had already been marked as handled by another element along the event route.
 (Inherited from UIElement.)
See Also
PreviewControl Class
PreviewControl Members
Autodesk.Revit.UI Namespace